7zip
alacritty
base
base-devel
bat
bind
blueberry
brightnessctl
btop
btrfs-progs
clang
cups
cups-browsed
cups-filters
cups-pdf
dnscrypt-proxy
docker
docker-buildx
docker-compose
dust
efibootmgr
egl-wayland
evince
fastfetch
fcitx5
fcitx5-gtk
fcitx5-qt
fd
ffmpegthumbnailer
fontconfig
gamemode
git
github-cli
gnome-calculator
gnome-keyring
gnome-themes-extra
greetd-tuigreet
gst-plugin-pipewire
gum
gvfs-mtp
gvfs-smb
hypridle
hyprland
hyprland-qtutils
hyprlock
hyprpicker
hyprshot
hyprsunset
ifuse
imagemagick
impala
imv
inetutils
intel-ucode
iwd
jq
jre-openjdk-headless
kvantum-qt5
lazydocker
lazygit
less
libpulse
libqalculate
libreoffice-fresh
libva-nvidia-driver
libyaml
linux
linux-firmware
linux-headers
llvm
luarocks
mako
man-db
mangohud
mariadb-libs
mesa-utils
mise
mpv
nautilus
neovim
noto-fonts
noto-fonts-cjk
noto-fonts-emoji
noto-fonts-extra
nss-mdns
nvidia-open-dkms
nvidia-utils
ollama-cuda
pacman-contrib
pamixer
pipewire
pipewire-alsa
pipewire-jack
pipewire-pulse
playerctl
plocate
polkit-gnome
postgresql-libs
python-gobject
python-poetry-core
qt5-wayland
qutebrowser
resvg
ripgrep
rofi
rsync
rust
satty
slurp
snapper
sof-firmware
stow
sushi
swaybg
swayosd
system-config-printer
tldr
tlp
tmux
tree
tree-sitter-cli
ttf-cascadia-mono-nerd
ttf-dejavu
ttf-jetbrains-mono-nerd
udiskie
ufw
unzip
usage
usbmuxd
waybar
webkit2gtk
wev
wezterm
wf-recorder
whois
wireless-regdb
wiremix
wireplumber
wl-clip-persist
wl-clipboard
woff2-font-awesome
xdg-desktop-portal-gtk
xdg-desktop-portal-hyprland
xmlstarlet
yazi
zoxide
zram-generator
zsh
